"Open ShortcutAI" = "ShortcutAIを開く";
"Settings" = "設定";
"Quit" = "終了";
"General" = "一般";
"Actions" = "アクション";
"Templates" = "テンプレート";
"Plugins" = "プラグイン";
"About" = "このアプリについて";

"ShortcutAI is running" = "ShortcutAIは実行中です";
"Press ⌘ + ⇧ + Space to open" = "⌘ + ⇧ + Space で開く";
"Or click the menu bar icon" = "またはメニューバーのアイコンをクリック";

"Turn any AI task" = "あらゆるAIタスクを";
"into a keyboard shortcut" = "キーボードショートカットに";
"Get Started" = "はじめる";
"How to open ShortcutAI" = "ShortcutAIの開き方";
"Continue" = "続ける";

"Shortcut" = "ショートカット";
"Set your keyboard shortcut to\nsummon ShortcutAI from anywhere." = "どこからでもShortcutAIを呼び出せる\nショートカットを設定しましょう。";
"Click to record shortcut..." = "クリックしてショートカットを記録...";
"Click the box above to record a new\nshortcut. You can change this anytime in\nthe settings." = "上のボックスをクリックして新しい\nショートカットを記録します。\n設定からいつでも変更できます。";
"Next" = "次へ";
"e.g." = "例:";
"Recording..." = "記録中...";
"Press ⌘ or ⌥ + key" = "⌘ または ⌥ + キーを押してください";

"Accessibility" = "アクセシビリティ";
"Accessibility permissions are required\nfor ShortcutAI to function." = "ShortcutAIを使うには\nアクセシビリティ許可が必要です。";
"Global keyboard shortcuts" = "グローバルキーボードショートカット";
"Text selection detection" = "テキスト選択の検出";
"Paste transformed text" = "変換後テキストの貼り付け";
"Click 'Grant Permissions'" = "「権限を許可」をクリック";
"Find ShortcutAI in the list" = "リストでShortcutAIを見つける";
"Enable using the toggle" = "トグルで有効にする";
"I need help" = "ヘルプが必要です";
"Grant Permissions" = "権限を許可";
"Permission Granted!" = "権限が許可されました！";
"Waiting for Permissions" = "権限待ち";

"Create Account" = "アカウント作成";
"Sign In" = "サインイン";
"Sign in to access your actions\nand settings." = "サインインしてアクションと\n設定にアクセスします。";
"Sign in to sync your actions\nacross devices." = "サインインしてアクションを\nデバイス間で同期します。";
"Email" = "メール";
"Password" = "パスワード";
"Forgot password?" = "パスワードを忘れた場合";
"Creating..." = "作成中...";
"Signing in..." = "サインイン中...";
"or" = "または";
"Continue with Google" = "Googleで続行";
"Already have an account?" = "すでにアカウントをお持ちですか？";
"Don't have an account?" = "アカウントをお持ちでないですか？";
"Sign Up" = "新規登録";
"Check your email for a password reset link." = "パスワード再設定リンクをメールで確認してください。";
"Reset Password" = "パスワードを再設定";
"Enter your email and we'll send you a link to reset your password." = "メールアドレスを入力すると、\nパスワード再設定リンクを送信します。";
"Send Reset Link" = "再設定リンクを送信";

"AI Chat" = "AIチャット";
"Start a conversation" = "会話を始める";
"Ask me anything! I can help with writing,\ncoding, analysis, and more." = "何でも聞いてください。文章作成、\nコーディング、分析などを手伝えます。";
"Quick Prompt" = "クイックプロンプト";
"Quick Action" = "クイックアクション";
"Press Enter to run" = "Enterで実行";
"close" = "閉じる";
"run" = "実行";
"navigate" = "移動";
"select" = "選択";
"cancel" = "キャンセル";

"Sign In Required" = "サインインが必要です";
"Please sign in to use ShortcutAI" = "ShortcutAIを使うにはサインインしてください";

"Copy" = "コピー";
"Replace" = "置換";
"Copy All" = "すべてコピー";
"Action saved" = "アクションを保存しました";
"New Action" = "新しいアクション";
"No Action Selected" = "アクション未選択";
"Start by creating a new action or select an\nexisting one from the list." = "まず新しいアクションを作成するか、\n一覧から既存のアクションを選択してください。";
"Enter your prompt here" = "ここにプロンプトを入力";
"Enhance" = "改善";
"Delete" = "削除";
"Are you sure?" = "本当に削除しますか？";
"Save" = "保存";
"Saved" = "保存済み";
"Already in use" = "すでに使用中";
"API Configuration" = "API設定";
"AI Provider" = "AIプロバイダー";
"API Key" = "APIキー";
"Web Search - Perplexity (Optional)" = "Web検索 - Perplexity（任意）";
"Preferences" = "環境設定";
"Global Shortcut" = "グローバルショートカット";
"Appearance" = "表示";
"Permissions" = "権限";
"Accessibility Permission" = "アクセシビリティ権限";
"Required for global keyboard shortcuts to work" = "グローバルショートカット機能に必要です";
"Open Settings" = "設定を開く";
"Developer" = "開発者";
"Reset Onboarding" = "オンボーディングをリセット";
"Show onboarding screens again on next launch" = "次回起動時にオンボーディングを再表示";
"Reset & Quit" = "リセットして終了";

"Prompt Templates" = "プロンプトテンプレート";
"Click to add to Actions" = "クリックでアクションに追加";
"All" = "すべて";

"Yearly" = "年額";
"Unlock Full Potential" = "すべての機能を解放";
"Billed yearly at $14.99" = "年額 $14.99 で請求";
"Unlimited actions" = "アクション無制限";
"All ShortcutAI features" = "ShortcutAIの全機能";
"Priority support" = "優先サポート";
"Free updates" = "無料アップデート";
"Get started" = "開始する";
"Sign in to upgrade" = "アップグレードするにはサインイン";
"Maybe later" = "あとで";
"3 days free" = "3日間無料";

"Check for Updates" = "アップデートを確認";
"Update Available" = "アップデートがあります";
"Download" = "ダウンロード";
"Later" = "あとで";
"Error" = "エラー";
"OK" = "OK";
"Up to Date" = "最新です";
"Contact Support" = "サポートに連絡";
"Get help from our team" = "チームによるサポート";
"Contact" = "連絡";

"Language" = "言語";
"System" = "システム";
"English" = "英語";
"Japanese" = "日本語";

"Setup ShortcutAI" = "ShortcutAIのセットアップ";
"Complete onboarding in one screen." = "1画面で初期設定を完了します。";
"Accessibility Check" = "アクセシビリティ確認";
"Permission granted." = "権限は許可済みです。";
"Grant accessibility to enable global shortcuts." = "グローバルショートカットのためにアクセシビリティ権限を許可してください。";
"Refresh Status" = "状態を更新";
"API Key Setup" = "APIキー設定";
"Pick a provider and add your API key." = "プロバイダーを選んでAPIキーを追加します。";
"Provider" = "プロバイダー";
"Create Your First Action" = "最初のアクションを作成";
"Define one action you can run right away." = "すぐ使えるアクションを1つ定義します。";
"Action Name (e.g. Rewrite politely)" = "アクション名（例: 丁寧に書き直す）";
"Prompt (e.g. Rewrite the text clearly and return only the rewritten text.)" = "プロンプト（例: 文章を明確に書き直し、書き直した文のみ返す）";
"Finish Setup" = "セットアップを完了";
"Granted" = "許可済み";
"Not Granted" = "未許可";

"Execution Insights" = "実行インサイト";
"Execution stats format" = "成功 %d%% • 平均 %dms • 実行回数 %d";
"Auto Prompt Suggestion" = "自動プロンプト提案";
"Apply Suggestion" = "提案を適用";
"Top failures: %@" = "主な失敗: %@";
"Success rate summary format" = "成功率は %d%%（%d 回実行）です。出力条件と失敗時の挙動を明確化しましょう。";
"Average response summary format" = "平均応答時間は %dms です。スコープを絞ると高速化できます。";
"No input text was selected." = "入力テキストが選択されていません。";
"API key was missing or invalid." = "APIキーが未設定、または無効です。";
"The request timed out." = "リクエストがタイムアウトしました。";
"Network issue during request." = "リクエスト中にネットワークエラーが発生しました。";
"Unknown failure." = "不明な失敗です。";
